[net]
# Testing
#batch=1
#subdivisions=1
# Training
batch=64
subdivisions=14
width=512
height=512
channels=3
momentum=0.9
decay=0.0005
angle=0
saturation = 1.5
exposure = 1.5
hue=.1
mixup=1
blur=10

learning_rate=0.0005
burn_in=1000
max_batches = 10000

policy=sgdr
sgdr_cycle=1000
sgdr_mult=2
#steps=4000,6000,8000,9000
#scales=1, 1, 0.1, 0.1

[convolutional]
batch_normalize=1
filters=24
size=3
stride=1
pad=1
activation=swish


#### deformation-block

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=8
size=5
stride=1
pad=1
activation=swish

[route]
layers=-3

[maxpool]
size=2
stride=1
stride_x=2
stride_y=1

[convolutional]
batch_normalize=1
filters=8
share_index=-3
size=5
stride_x=1
stride_y=2
pad=1
activation=swish

[route]
layers=-6

[maxpool]
size=2
stride=1
stride_x=1
stride_y=2

[convolutional]
batch_normalize=1
filters=8
share_index=-6
size=5
stride_x=2
stride_y=1
pad=1
activation=swish

[route]
layers=-9

[convolutional]
batch_normalize=1
filters=8
share_index=-8
size=5
stride=1
pad=1
activation=swish

[reorg3d]
stride=2

[route]
layers=-1,-4,-7,-10

[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=swish

#####

[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=swish



#### deformation-block

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=16
size=5
stride=1
pad=1
activation=swish

[route]
layers=-3

[maxpool]
size=2
stride=1
stride_x=2
stride_y=1

[convolutional]
batch_normalize=1
filters=16
share_index=-3
size=5
stride_x=1
stride_y=2
pad=1
activation=swish

[route]
layers=-6

[maxpool]
size=2
stride=1
stride_x=1
stride_y=2

[convolutional]
batch_normalize=1
filters=16
share_index=-6
size=5
stride_x=2
stride_y=1
pad=1
activation=swish

[route]
layers=-9

[convolutional]
batch_normalize=1
filters=16
share_index=-8
size=5
stride=1
pad=1
activation=swish

[reorg3d]
stride=2

[route]
layers=-1,-4,-7,-10

[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=swish

#####


[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=swish


#### deformation-block

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=32
size=5
stride=1
pad=1
activation=swish

[route]
layers=-3

[maxpool]
size=2
stride=1
stride_x=2
stride_y=1

[convolutional]
batch_normalize=1
filters=32
share_index=-3
size=5
stride_x=1
stride_y=2
pad=1
activation=swish

[route]
layers=-6

[maxpool]
size=2
stride=1
stride_x=1
stride_y=2

[convolutional]
batch_normalize=1
filters=32
share_index=-6
size=5
stride_x=2
stride_y=1
pad=1
activation=swish

[route]
layers=-9

[convolutional]
batch_normalize=1
filters=32
share_index=-8
size=5
stride=1
pad=1
activation=swish

[reorg3d]
stride=2

[route]
layers=-1,-4,-7,-10

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=swish

#####


[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=swish


#### deformation-block

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=64
size=5
stride=1
pad=1
activation=swish

[route]
layers=-3

[maxpool]
size=2
stride=1
stride_x=2
stride_y=1

[convolutional]
batch_normalize=1
filters=64
share_index=-3
size=5
stride_x=1
stride_y=2
pad=1
activation=swish

[route]
layers=-6

[maxpool]
size=2
stride=1
stride_x=1
stride_y=2

[convolutional]
batch_normalize=1
filters=64
share_index=-6
size=5
stride_x=2
stride_y=1
pad=1
activation=swish

[route]
layers=-9

[convolutional]
batch_normalize=1
filters=64
share_index=-8
size=5
stride=1
pad=1
activation=swish

[reorg3d]
stride=2

[route]
layers=-1,-4,-7,-10

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=swish

#####


[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=swish


#### deformation-block

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=128
size=5
stride=1
pad=1
activation=swish

[route]
layers=-3

[maxpool]
size=2
stride=1
stride_x=2
stride_y=1

[convolutional]
batch_normalize=1
filters=128
share_index=-3
size=5
stride_x=1
stride_y=2
pad=1
activation=swish

[route]
layers=-6

[maxpool]
size=2
stride=1
stride_x=1
stride_y=2

[convolutional]
batch_normalize=1
filters=128
share_index=-6
size=5
stride_x=2
stride_y=1
pad=1
activation=swish

[route]
layers=-9

[convolutional]
batch_normalize=1
filters=128
share_index=-8
size=5
stride=1
pad=1
activation=swish

[reorg3d]
stride=2

[route]
layers=-1,-4,-7,-10

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=swish

#####


[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=swish

### SPP ###
[maxpool]
stride=1
size=5

[route]
layers=-2

[maxpool]
stride=1
size=9

[route]
layers=-4

[maxpool]
stride=1
size=13

[route]
layers=-1,-3,-5,-6

### End SPP ###

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=swish

[shortcut]
from=-10
activation=linear

[convolutional]
batch_normalize=1
filters=1024
size=3
stride=1
pad=1
activation=swish

###########

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=swish


#### deformation-block

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=128
size=5
stride=1
pad=1
activation=swish

[route]
layers=-3

[maxpool]
size=2
stride=1
stride_x=2
stride_y=1

[convolutional]
batch_normalize=1
filters=128
share_index=-3
size=5
stride_x=1
stride_y=2
pad=1
activation=swish

[route]
layers=-6

[maxpool]
size=2
stride=1
stride_x=1
stride_y=2

[convolutional]
batch_normalize=1
filters=128
share_index=-6
size=5
stride_x=2
stride_y=1
pad=1
activation=swish

[route]
layers=-9

[convolutional]
batch_normalize=1
filters=128
share_index=-8
size=5
stride=1
pad=1
activation=swish

[reorg3d]
stride=2

[route]
layers=-1,-4,-7,-10

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=swish

#####

[upsample]
stride=2

[route]
layers=-1,-15


########### to [yolo-3]


[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=swish
assisted_excitation=4000

[upsample]
stride=2

[route]
layers = -1, 55

###########

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=swish


[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=swish

########### to [yolo-2]


[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=swish

[upsample]
stride=2

[route]
layers = -1, 41

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=swish

########### features of different layers


[route]
layers=13

[maxpool]
size=4
stride=4

[route]
layers=27

[maxpool]
size=2
stride=2

[route]
layers=41

[route]
layers=55

[upsample]
stride=2

[route]
layers=69

[upsample]
stride=4


[route]
layers=-1, -3, -5, -6, -8

[maxpool]
maxpool_depth=1
out_channels=32
stride=1
size=1


###########

########### [yolo-1]


##########################

[route]
layers=27

[reorg3d]
stride=2

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=64
activation=swish

[route]
layers=-1,118,107

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=64
activation=swish

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=64
activation=swish

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=64
activation=swish

[shortcut]
activation=linear
from=-3

[convolutional]
size=1
stride=1
pad=1
filters=30
# filters  = (classes + 8 + 1) * <numbers in mask>    // for [Gaussian_yolo]
activation=linear

[Gaussian_yolo]
mask = 0,3
anchors = 8,8,  8,16,  16,8,  16,16,  16,32,  32,16,               32,32,  32,64,  64,32,  64,64,  64,128,  128,64,     128,128,  128,192,  192,128,  192,192,  129,256,  256,192,     192,192,  192,256,  256,192,  256,256,  256,384,  384,256,     384,384
#anchors = 7, 11,  12, 30,  26, 15,  29, 34,  18, 62,  65, 28,     42, 58,  29,106,  79, 62,  58,100, 144, 43,  45,181,    118, 94,  86,144,  73,251, 282, 70, 183,129, 130,190,       111,309, 221,214, 349,142, 170,321, 363,244, 258,345,          389,379
classes=6
num=25
jitter=.3
ignore_thresh = .7
truth_thresh = 1
iou_thresh=0.213
uc_normalizer=1.0
cls_normalizer=1.0
iou_normalizer=0.5
iou_loss=giou
scale_x_y = 1.05
random=1




[route]
layers=-6

[convolutional]
batch_normalize=1
size=3
pad=1
filters=64
activation=swish
stride_x=1
stride_y=2

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=64
activation=swish

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=64
activation=swish

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=64
activation=swish

[shortcut]
activation=linear
from= -3

[convolutional]
size=1
stride=1
pad=1
filters=30
# filters  = (classes + 8 + 1) * <numbers in mask>    // for [Gaussian_yolo]
activation=linear

[Gaussian_yolo]
mask = 1,4
anchors = 8,8,  8,16,  16,8,  16,16,  16,32,  32,16,               32,32,  32,64,  64,32,  64,64,  64,128,  128,64,     128,128,  128,192,  192,128,  192,192,  129,256,  256,192,     192,192,  192,256,  256,192,  256,256,  256,384,  384,256,     384,384
#anchors = 7, 11,  12, 30,  26, 15,  29, 34,  18, 62,  65, 28,     42, 58,  29,106,  79, 62,  58,100, 144, 43,  45,181,    118, 94,  86,144,  73,251, 282, 70, 183,129, 130,190,       111,309, 221,214, 349,142, 170,321, 363,244, 258,345,          389,379
classes=6
num=25
jitter=.3
ignore_thresh = .7
truth_thresh = 1
iou_thresh=0.213
uc_normalizer=1.0
cls_normalizer=1.0
iou_normalizer=0.5
iou_loss=giou
scale_x_y = 1.05
random=1



[route]
layers=-14

[convolutional]
batch_normalize=1
size=3
pad=1
filters=64
activation=swish
stride_x=2
stride_y=1

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=64
activation=swish

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=64
activation=swish

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=64
activation=swish

[shortcut]
activation=linear
from= -3

[convolutional]
size=1
stride=1
pad=1
filters=30
# filters  = (classes + 8 + 1) * <numbers in mask>    // for [Gaussian_yolo]
activation=linear

[Gaussian_yolo]
mask = 2,5
anchors = 8,8,  8,16,  16,8,  16,16,  16,32,  32,16,               32,32,  32,64,  64,32,  64,64,  64,128,  128,64,     128,128,  128,192,  192,128,  192,192,  129,256,  256,192,     192,192,  192,256,  256,192,  256,256,  256,384,  384,256,     384,384
#anchors = 7, 11,  12, 30,  26, 15,  29, 34,  18, 62,  65, 28,     42, 58,  29,106,  79, 62,  58,100, 144, 43,  45,181,    118, 94,  86,144,  73,251, 282, 70, 183,129, 130,190,       111,309, 221,214, 349,142, 170,321, 363,244, 258,345,          389,379
classes=6
num=25
jitter=.3
ignore_thresh = .7
truth_thresh = 1
iou_thresh=0.213
uc_normalizer=1.0
cls_normalizer=1.0
iou_normalizer=0.5
iou_loss=giou
scale_x_y = 1.05
random=1

##########################


[route]
layers=118

[maxpool]
size=2
stride=2

[route]
layers=41

[reorg3d]
stride=2

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=128
activation=swish

[route]
layers=103,-1,-4

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=128
activation=swish

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=128
activation=swish

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=128
activation=swish

[shortcut]
activation=linear
from=-3

[convolutional]
size=1
stride=1
pad=1
filters=30
# filters  = (classes + 8 + 1) * <numbers in mask>    // for [Gaussian_yolo]
activation=linear

[Gaussian_yolo]
mask = 6,9
anchors = 8,8,  8,16,  16,8,  16,16,  16,32,  32,16,               32,32,  32,64,  64,32,  64,64,  64,128,  128,64,     128,128,  128,192,  192,128,  192,192,  129,256,  256,192,     192,192,  192,256,  256,192,  256,256,  256,384,  384,256,     384,384
#anchors = 7, 11,  12, 30,  26, 15,  29, 34,  18, 62,  65, 28,     42, 58,  29,106,  79, 62,  58,100, 144, 43,  45,181,    118, 94,  86,144,  73,251, 282, 70, 183,129, 130,190,       111,309, 221,214, 349,142, 170,321, 363,244, 258,345,          389,379
classes=6
num=25
jitter=.3
ignore_thresh = .7
truth_thresh = 1
iou_thresh=0.213
uc_normalizer=1.0
cls_normalizer=1.0
iou_normalizer=0.5
iou_loss=giou
scale_x_y = 1.1
random=1


[route]
layers = -6

[convolutional]
batch_normalize=1
size=3
pad=1
filters=128
activation=swish
stride_x=1
stride_y=2

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=128
activation=swish

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=128
activation=swish

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=128
activation=swish

[shortcut]
activation=linear
from= -3

[convolutional]
size=1
stride=1
pad=1
filters=30
# filters  = (classes + 8 + 1) * <numbers in mask>    // for [Gaussian_yolo]
activation=linear

[Gaussian_yolo]
mask = 7,10
anchors = 8,8,  8,16,  16,8,  16,16,  16,32,  32,16,               32,32,  32,64,  64,32,  64,64,  64,128,  128,64,     128,128,  128,192,  192,128,  192,192,  129,256,  256,192,     192,192,  192,256,  256,192,  256,256,  256,384,  384,256,     384,384
#mask = 7,11
#anchors = 7, 11,  12, 30,  26, 15,  29, 34,  18, 62,  65, 28,     42, 58,  29,106,  79, 62,  58,100, 144, 43,  45,181,    118, 94,  86,144,  73,251, 282, 70, 183,129, 130,190,       111,309, 221,214, 349,142, 170,321, 363,244, 258,345,          389,379
classes=6
num=25
jitter=.3
ignore_thresh = .7
truth_thresh = 1
iou_thresh=0.213
uc_normalizer=1.0
cls_normalizer=1.0
iou_normalizer=0.5
iou_loss=giou
scale_x_y = 1.1
random=1


[route]
layers = -14

[convolutional]
batch_normalize=1
size=3
pad=1
filters=128
activation=swish
stride_x=2
stride_y=1

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=128
activation=swish

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=128
activation=swish

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=128
activation=swish

[shortcut]
activation=linear
from= -3

[convolutional]
size=1
stride=1
pad=1
filters=30
# filters  = (classes + 8 + 1) * <numbers in mask>    // for [Gaussian_yolo]
activation=linear

[Gaussian_yolo]
mask = 8,11
anchors = 8,8,  8,16,  16,8,  16,16,  16,32,  32,16,               32,32,  32,64,  64,32,  64,64,  64,128,  128,64,     128,128,  128,192,  192,128,  192,192,  129,256,  256,192,     192,192,  192,256,  256,192,  256,256,  256,384,  384,256,     384,384
#mask = 8,10
#anchors = 7, 11,  12, 30,  26, 15,  29, 34,  18, 62,  65, 28,  42, 58,  29,106,  79, 62,  58,100, 144, 43,  45,181, 118, 94,  86,144,  73,251, 282, 70, 183,129, 130,190, 111,309, 221,214, 349,142, 170,321, 363,244, 258,345, 389,379
classes=6
num=25
jitter=.3
ignore_thresh = .7
truth_thresh = 1
iou_thresh=0.213
uc_normalizer=1.0
cls_normalizer=1.0
iou_normalizer=0.5
iou_loss=giou
scale_x_y = 1.1
random=1

##########################

[route]
layers=118

[maxpool]
size=4
stride=4

[route]
layers=55

[reorg3d]
stride=2

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=256
activation=swish

[route]
layers=98,-1,-4

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=256
activation=swish

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=256
activation=swish

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=swish

[shortcut]
activation=linear
from=-3

[convolutional]
size=1
stride=1
pad=1
filters=45
# filters  = (classes + 8 + 1) * <numbers in mask>    // for [Gaussian_yolo]
activation=linear

[Gaussian_yolo]
mask = 12,15,18
anchors = 8,8,  8,16,  16,8,  16,16,  16,32,  32,16,               32,32,  32,64,  64,32,  64,64,  64,128,  128,64,     128,128,  128,192,  192,128,  192,192,  129,256,  256,192,     192,192,  192,256,  256,192,  256,256,  256,384,  384,256,     384,384
#mask = 12,13,17
#anchors = 7, 11,  12, 30,  26, 15,  29, 34,  18, 62,  65, 28,  42, 58,  29,106,  79, 62,  58,100, 144, 43,  45,181, 118, 94,  86,144,  73,251, 282, 70, 183,129, 130,190, 111,309, 221,214, 349,142, 170,321, 363,244, 258,345, 389,379
classes=6
num=25
jitter=.3
ignore_thresh = .7
truth_thresh = 1
iou_thresh=0.213
uc_normalizer=1.0
cls_normalizer=1.0
iou_normalizer=0.5
iou_loss=giou
scale_x_y = 1.2
random=1


[route]
layers = -6

[convolutional]
batch_normalize=1
size=3
pad=1
filters=256
activation=swish
stride_x=1
stride_y=2

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=256
activation=swish

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=256
activation=swish

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=swish

[shortcut]
activation=linear
from= -3

[convolutional]
size=1
stride=1
pad=1
filters=45
# filters  = (classes + 8 + 1) * <numbers in mask>    // for [Gaussian_yolo]
activation=linear

[Gaussian_yolo]
mask = 13,16,19
anchors = 8,8,  8,16,  16,8,  16,16,  16,32,  32,16,               32,32,  32,64,  64,32,  64,64,  64,128,  128,64,     128,128,  128,192,  192,128,  192,192,  129,256,  256,192,     192,192,  192,256,  256,192,  256,256,  256,384,  384,256,     384,384
#mask = 14,18,21
#anchors = 7, 11,  12, 30,  26, 15,  29, 34,  18, 62,  65, 28,  42, 58,  29,106,  79, 62,  58,100, 144, 43,  45,181, 118, 94,  86,144,  73,251, 282, 70, 183,129, 130,190, 111,309, 221,214, 349,142, 170,321, 363,244, 258,345, 389,379
classes=6
num=25
jitter=.3
ignore_thresh = .7
truth_thresh = 1
iou_thresh=0.213
uc_normalizer=1.0
cls_normalizer=1.0
iou_normalizer=0.5
iou_loss=giou
scale_x_y = 1.2
random=1


[route]
layers = -14

[convolutional]
batch_normalize=1
size=3
pad=1
filters=256
activation=swish
stride_x=2
stride_y=1

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=256
activation=swish

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=256
activation=swish

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=swish

[shortcut]
activation=linear
from= -3

[convolutional]
size=1
stride=1
pad=1
filters=45
# filters  = (classes + 8 + 1) * <numbers in mask>    // for [Gaussian_yolo]
activation=linear

[Gaussian_yolo]
mask = 14,17,20
anchors = 8,8,  8,16,  16,8,  16,16,  16,32,  32,16,               32,32,  32,64,  64,32,  64,64,  64,128,  128,64,     128,128,  128,192,  192,128,  192,192,  129,256,  256,192,     192,192,  192,256,  256,192,  256,256,  256,384,  384,256,     384,384
#mask = 15,16,20
#anchors = 7, 11,  12, 30,  26, 15,  29, 34,  18, 62,  65, 28,  42, 58,  29,106,  79, 62,  58,100, 144, 43,  45,181, 118, 94,  86,144,  73,251, 282, 70, 183,129, 130,190, 111,309, 221,214, 349,142, 170,321, 363,244, 258,345, 389,379
classes=6
num=25
jitter=.3
ignore_thresh = .7
truth_thresh = 1
iou_thresh=0.213
uc_normalizer=1.0
cls_normalizer=1.0
iou_normalizer=0.5
iou_loss=giou
scale_x_y = 1.2
random=1

#################

[route]
layers=118

[maxpool]
size=4
stride=4

[route]
layers=69,98,-1

[reorg3d]
stride=2

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=256
activation=swish

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=256
activation=swish

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=256
activation=swish

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=swish

[shortcut]
activation=linear
from=-3

[convolutional]
size=1
stride=1
pad=1
filters=60
# filters  = (classes + 8 + 1) * <numbers in mask>    // for [Gaussian_yolo]
activation=linear

[Gaussian_yolo]
mask = 21,22,23,24
anchors = 8,8,  8,16,  16,8,  16,16,  16,32,  32,16,               32,32,  32,64,  64,32,  64,64,  64,128,  128,64,     128,128,  128,192,  192,128,  192,192,  129,256,  256,192,     192,192,  192,256,  256,192,  256,256,  256,384,  384,256,     384,384
#mask = 19,22,23,24
#anchors = 7, 11,  12, 30,  26, 15,  29, 34,  18, 62,  65, 28,  42, 58,  29,106,  79, 62,  58,100, 144, 43,  45,181, 118, 94,  86,144,  73,251, 282, 70, 183,129, 130,190, 111,309, 221,214, 349,142, 170,321, 363,244, 258,345, 389,379
classes=6
num=25
jitter=.3
ignore_thresh = .7
truth_thresh = 1
iou_thresh=0.213
uc_normalizer=1.0
cls_normalizer=1.0
iou_normalizer=0.5
iou_loss=giou
scale_x_y = 1.2
random=0

